Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetBoltItems Method
 Returns an enumerator of all bolt items.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltItemEnumerator GetBoltItems()
Public Function GetBoltItems As BoltItemEnumerator
Return Value
Type: BoltItemEnumerator
A BoltItemEnumerator of all bolt items.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace